export const exampleCompetentions = [
  'Способность к абстрактному мышлению',
  'Готовность к коммуникации',
  'Разработка концептуальных моделей',
  'Разработка архитектуры систем',
  'Проведение научных исследований',
  'Работа в научном коллективе',
  'Приобретение новых знаний',
  'Анализ поставленной задачи',
  'Создание спецификаций',
  'Математическое моделирование',
];

export const exampleSubjects = [
  {
    name: 'Современные СУБД',
    neededCompetentences: ['Работа в научном коллективе'],
    earnedCompetentences: ['Анализ поставленной задачи'],
    credits: 1,
  },
  {
    name: 'Основы цифрового производства',
    neededCompetentences: ['Приобретение новых знаний'],
    earnedCompetentences: ['Создание спецификаций'],
    credits: 5,
  },
  {
    name: 'Построение аналитических приложений',
    neededCompetentences: ['Работа в научном коллективе', 'Приобретение новых знаний'],
    earnedCompetentences: ['Математическое моделирование'],
    credits: 2,
  },

  {
    name: 'Математическое моделирование',
    neededCompetentences: [],
    earnedCompetentences: ['Способность к абстрактному мышлению', 'Готовность к коммуникации'],
    credits: 4,
  },
  {
    name: 'Алгоритмы и структуры данных',
    neededCompetentences: [],
    earnedCompetentences: ['Готовность к коммуникации', 'Разработка концептуальных моделей'],
    credits: 3,
  },
  {
    name: 'Научно-исследовательская деятельность',
    neededCompetentences: [],
    earnedCompetentences: ['Готовность к коммуникации', 'Разработка концептуальных моделей'],
    credits: 2,
  },

  {
    name: 'Управление проектами',
    neededCompetentences: [],
    earnedCompetentences: ['Разработка архитектуры систем', 'Проведение научных исследований'],
    credits: 3,
  },
  {
    name: 'Методы глубокого обучения',
    neededCompetentences: [
      'Способность к абстрактному мышлению',
      'Готовность к коммуникации',
      'Разработка концептуальных моделей',
    ],
    earnedCompetentences: ['Работа в научном коллективе'],
    credits: 3,
  },
  {
    name: 'Иностранный язык',
    neededCompetentences: ['Разработка концептуальных моделей'],
    earnedCompetentences: ['Приобретение новых знаний'],
    credits: 2,
  },
];
